Repository: zelalem61/BMI-calculator-et
Catalog: lib/src/language/arb/app_*.arb
Languages: am, or, tr

# title
source: BMI Calculator
am: BMI ካልኩሌተር
or: Shallaggii BMI
tr: BMI ካልኩሌተር

# health
source: Health Kit
am: የጤና ኪት
or: Kit Fayyaa
tr: ናይ ጥዕና ዕጥቂ

source: GENDER
am: ጾታ
or: KOORNIYAA
tr: ፆታ

source: Male
am: ወንድ
or: Dhiira
tr: ተባዕታይ

source: Female
am: ሴት
or: Dhalaa
tr: ኣንስተይቲ

source: HEIGHT
am: ቁመት
or: HOJJAA
tr: ቁመት

source: WEIGHT
am: ክብደት
or: ULFAATINA
tr: ክብደት

source: Change Language
am: ቋንቋ መቀየር
or: Afaan Jijjiirraa
tr: ቋንቋ ምቕያር

source: English
am: እንግሊዝኛ
or: Afaan Ingilizii
tr: ኢንግሊሽ

# amharic
source: አማርኛ
or: Afaan Amaaraa
tr: ኣምሓርኛ

# bmiInfoFirst
source: Body mass index, or BMI, is used to determine whether you are in a healthy weight range for your height.
am: የሰውነት ክብደት መረጃ ጠቋሚ ወይም BMI በቁመትዎ ጤናማ የክብደት ክልል ውስጥ መሆንዎን ለመወሰን ይጠቅማል።
or: Body mass index ykn BMI dheerina keetif ulfaatina fayya qabeessa taâ€™e keessa jiraachuu fi dhiisuu kee murteessuuf kan gargaarudha.
tr: ቦዲ ማስ ኢንዴክስ ወይ BMI ንቁመትካ ኣብ ጥዑይ ክብደት ምህላውካ ንምፍላጥ ይጥቀመሉ።

# bmiInfoSecond
source: * This calculator shouldn't be used for pregnant women or children.
am: * ይህ ካልኩሌተር ለነፍሰ ጡር ሴቶች ወይም ልጆች ጥቅም ላይ መዋል የለበትም።
or: * Shallaggiin kun dubartoota ulfaa ykn daa'immaniif fayyadamuu hin qabu.
tr: * እዚ ካልኩሌተር ንነፍሰጾራት ወይ ንህጻናት ክውዕል የብሉን።

source: YOUR BMI
am: የእርስዎ BMI
or: BMI KEE
tr: BMI ናትካ

source: The BMI Chart
am: BMI ገበታ
or: Chaartii BMI
tr: እቲ ናይ BMI ቻርት

source: Close
am: አጥፋ
or: Cufuu
tr: ዕፁው

# bmiInterpretationOverweight
source: You have a higher than normal body weight. Try to exercise more.
am: ክብደትዎ ከተለመደው የሰውነት ክብደት ከፍ ያለ ነው. ተጨማሪ የአካል ብቃት እንቅስቃሴ ለማድረግ ይሞክሩ።
or: Ulfaatina qaamaa idilee caalaa olka'aa qabda. Sochii qaamaa dabalataa gochuuf yaali.
tr: ካብ ንቡር ንላዕሊ ክብደት ኣካላትካ ኣለካ። ዝያዳ ኣካላዊ ምንቅስቓስ ክትገብር ፈትን።

# bmiInterpretationNormal
source: You have a normal body weight. Great job!
am: መደበኛ የሰውነት ክብደት አለህ። ብራቮ!
or: Ulfaatina qaamaa idilee qabda. Hojii guddaa!
tr: ንቡር ክብደት ኣካላትካ ኣለካ። ብሉጽ ስራሕ!

# bmiInterpretationUnderweight
source: You have a lower than normal body weight. You can eat a bit more.
am: ክብደትዎ ከተለመደው የሰውነት ክብደት ያነሰ ነው. ትንሽ ተጨማሪ መብላት ይችላሉ.
or: Ulfaatina qaamaa idilee caalaa gadi aanaa qabda. Xiqqoo dabalataan nyaachuu dandeessu.
tr: ካብ ንቡር ንታሕቲ ክብደት ኣካላትካ ኣለካ። ቁሩብ ተወሳኺ ክትበልዕ ትኽእል ኢኻ።

# recommendationDiet
source: Recommendation Diets
am: የምክር ምግቦች
or: Nyaata Gorsa
tr: ለበዋ ኣመጋግባታት

# recommendationExe
source: Recommendation Exercises
am: ምክሮች ስፖርት መልመጃዎች
or: Shaakala Gorsaa
tr: ናይ ለበዋ ልምምድ

source: chest
am: ደረት
or: laphee
tr: አፍ-ልቢ

source: ABs
am: ኤቢኤስ
tr: ኤቢስ

source: Biceps
am: ቢሴፕስ
or: Biceps jedhamuun beekama
tr: ባይሰፕስ

source: Triceps
am: ትራይሰፕስ
or: Triceps jedhamu
tr: ትራይሰፕስ

source: Salmon
am: ሳልሞን
or: Akaakuu qurxummii
tr: ዓይነት ዓሳ

source: Kale
am: ካሌ
or: Kalee
tr: ካሌ

source: Quinoa
or: Quinoa jedhamuun beekama
tr: ኪኖኣ

source: Burger
am: በርገር
tr: በርገር

source: Salad
am: ሰላጣ
or: Salaada
tr: ሰላጣ

# chicken
source: Checken Breast
am: የዶሮ ደረት ልስልስ ስጋ
or: Harma Chicken
tr: ጡብ ደርሆ

# sweet
source: Sweet Potato
am: ስኳር ድንች
or: Boqqolloo Mi'aawaa
tr: ሽኮር ድንሽ

# tgrigna
source: ትግርኛ
or: Afaan Tigrigna
